Revit 2027 API
CoordinationModelLinkData.GetPathType Method
 Returns the path type of the Coordination Model link.
 For a Coordination Model from Autodesk Docs, path type is Cloud.
 For a local Coordination Model, path type can be Absolute or Relative.
Namespace: Autodesk.Revit.DB.ExternalData
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public CoordinationModelLinkPathType GetPathType()
Public Function GetPathType As CoordinationModelLinkPathType
public:
CoordinationModelLinkPathType GetPathType()
member GetPathType : unit -> CoordinationModelLinkPathType
Return Value
CoordinationModelLinkPathType
See Also
Reference
CoordinationModelLinkData Class
Autodesk.Revit.DB.ExternalData Namespace